gerlabs-api/app/controllers/api/v2/courses_controller.rb

SELECT `courses`.* FROM `courses`
---
  def index
		courses = Course.all()

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 11 LIMIT 1
---
  def show
    begin
      @course = Course.find(params[:id])

INSERT INTO `courses` (`name`, `code`, `created_at`, `updated_at`) VALUES ('Aut minus cum sint laboriosam debitis unde.', 'Nostrum velit quidem iste.', '2019-03-26 23:51:11', '2019-03-26 23:51:11')
---
  def create
    course = Course.new(course_params)

    if course.save

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 6 LIMIT 1
DELETE FROM `courses` WHERE `courses`.`id` = 6
---
  def destroy
    course = Course.find(params[:id])
    course.destroy