gerlabs-api/app/controllers/api/v2/disciplines_controller.rb

SELECT `disciplines`.* FROM `disciplines`
---
  def index
		@disciplines = Discipline.all()

SELECT  `disciplines`.* FROM `disciplines` WHERE `disciplines`.`id` = 4 LIMIT 1
---
  def show
    begin
      @discipline = Discipline.find(params[:id])

INSERT INTO `disciplines` (`name`, `code`, `created_at`, `updated_at`) VALUES ('Hic non nihil architecto beatae.', 'Facilis at corrupti nemo.', '2019-03-27 00:14:21', '2019-03-27 00:14:21')
---
  def create
    discipline = Discipline.new(discipline_params)

    if discipline.save

SELECT  `disciplines`.* FROM `disciplines` WHERE `disciplines`.`id` = 16 LIMIT 1
DELETE FROM `disciplines` WHERE `disciplines`.`id` = 16
---
  def destroy
    discipline = Discipline.find(params[:id])
    discipline.destroy