gerlabs-api/app/controllers/api/v2/memories_controller.rb

  def index
		memories = Memory.all()
---
SELECT `memories`.* FROM `memories`

  def show
    begin
      @memory = Memory.find(params[:id])
---
SELECT  `memories`.* FROM `memories` WHERE `memories`.`id` = 11 LIMIT 1

  def create
    memory = Memory.new(memory_params)

    if memory.save
---
INSERT INTO `memories` (`name`, `created_at`, `updated_at`) VALUES ('Id deleniti numquam et.', '2019-03-27 00:05:33', '2019-03-27 00:05:33')

  def destroy
    memory = Memory.find(params[:id])
    memory.destroy
---
SELECT  `memories`.* FROM `memories` WHERE `memories`.`id` = 13 LIMIT 1
DELETE FROM `memories` WHERE `memories`.`id` = 16