gerlabs-api/app/controllers/api/v2/processors_controller.rb

  def index
		processors = Processor.all()
---
SELECT `processors`.* FROM `processors`

  def show
    begin
      @processor = Processor.find(params[:id])
---
SELECT  `processors`.* FROM `processors` WHERE `processors`.`id` = 1 LIMIT 1

  def create
    processor = Processor.new(processor_params)

    if processor.save
---
INSERT INTO `processors` (`name`, `created_at`, `updated_at`) VALUES ('Provident quidem quo autem rerum recusandae deserunt.', '2019-03-27 00:08:02', '2019-03-27 00:08:02')

  def destroy
    processor = Processor.find(params[:id])
    processor.destroy
---
SELECT  `processors`.* FROM `processors` WHERE `processors`.`id` = 3 LIMIT 1
DELETE FROM `processors` WHERE `processors`.`id` = 3