gerlabs-api/app/controllers/api/v2/tasks_controller.rb

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 6 AND `tasks`.`id` = 17 LIMIT 1
---
    task = current_user.tasks.find(params[:id])

INSERT INTO `tasks` (`title`, `description`, `deadline`, `user_id`, `created_at`, `updated_at`) VALUES ('Vel dolorum minima voluptas ducimus est ratione ut totam.', 'Et expedita vel aut dolorem. Cumque et libero corrupti aut autem in similique. Et qui commodi quas.', '2018-10-12 00:00:00', 8, '2018-09-12 00:01:39', '2018-09-12 00:01:39')
---
    task = current_user.tasks.build(task_params)

    if task.save

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 15 AND `tasks`.`id` = 23 LIMIT 1
UPDATE `tasks` SET `title` = 'New task title', `updated_at` = '2019-03-25 22:24:55' WHERE `tasks`.`id` = 5
---
    task = current_user.tasks.find(params[:id])

    if task.update_attributes(task_params)

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 1 AND `tasks`.`id` = 1 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 1
---
    task = current_user.tasks.find(params[:id])
    task.destroy