gerlabs-api/app/controllers/api/v2/video_cards_controller.rb

  def index
		video_cards = VideoCard.all()
---
SELECT `video_cards`.* FROM `video_cards`

  def show
    begin
      @video_card = VideoCard.find(params[:id])
---
SELECT  `video_cards`.* FROM `video_cards` WHERE `video_cards`.`id` = 3 LIMIT 1

  def create
    video_card = VideoCard.new(video_card_params)

    if video_card.save
---
INSERT INTO `video_cards` (`name`, `memory_gpu`, `created_at`, `updated_at`) VALUES ('Labore autem at deserunt culpa.', 'Et repellat nihil in.', '2019-03-27 00:11:08', '2019-03-27 00:11:08')

  def destroy
    video_card = VideoCard.find(params[:id])
    video_card.destroy
---
SELECT  `video_cards`.* FROM `video_cards` WHERE `video_cards`.`id` = 1 LIMIT 1
DELETE FROM `video_cards` WHERE `video_cards`.`id` = 1